InformationRegisters/А_ОчередьТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>А_ОчередьТрансляции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПоставленоВОчередь</Name>
					<Comment>Поставлено в очередь</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Протокол</Name>
					<Comment>Протокол</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТрансляции</Name>
					<Comment>Дата трансляции</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратТекущегоМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/ГраницыЗапретаИзмененияДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ГраницыЗапретаИзмененияДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГраницаЗапретаИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/А_НастройкиРежимовТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>А_НастройкиРежимовТрансляции</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Режим</Name>
					<Comment>Режим</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.А_РежимыТрансляции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/А_РежимыТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>А_РежимыТрансляции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеВыполнять</Name>
					<Comment>Трансляция не выполняется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OnLine</Name>
					<Comment>Трансляция выполняется при проведении документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложенный</Name>
					<Comment>При проведении документ ставится в очередь - трансляция выполняется регламентной обработкой по расписанию</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ручной</Name>
					<Comment>Трансляция выполняется обработкой Групповая трансляция</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийРКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРКО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПокупателю</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймамСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствПодотчетнику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствКассеККМ</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаличнымиВБанк</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходДенежныхСредствПрочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлатыПоВедомостям</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлатыРаботнику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияДенежныхСредств</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/А_Подписка/Ext/Module.bsl
Процедура ДополнитьМассивСсылками(ТекущийМассив, МассивДляДобавления)
	
	Если МассивДляДобавления = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из МассивДляДобавления Цикл
		
		Если ТекущийМассив.Найти(Элемент) = Неопределено Тогда
		
			ТекущийМассив.Добавить(Элемент);
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры
 
// NVV [26.11.2019 г.] ++
/////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ПОДПИСКИ НА СОБЫТИЕ ПРИ КОПИРОВАНИИ ДОКУМЕНТОВ ////




// NVV --
// А_Вячеслав(12.10.2020 
Функция ПолучитьМассивЗапрещенныхКИзменениюСправочников()

	лМас = Новый Массив;
	лМас.Добавить("ФизическиеЛица");
	лМас.Добавить("СтатьиДвиженияДенежныхСредств");
	лМас.Добавить("СтатьиДоходов");
	лМас.Добавить("СтатьиЗатрат");

	возврат лМас;
КонецФункции // ПолучитьМассивЗапрещенныхКИзменениюСправочников()




/////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ПОДПИСКИ НА СОБЫТИЕ ОБРАБОТКА ПРОВЕДЕНИЯ ДОКУМЕНТОВ ////

Процедура ОбработкаПроведенияДокументов(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Отказ Тогда
		Возврат
	КонецЕсли;
	Попытка
	Если Источник.Дата>Константы.А_ДатаНачалаТрансляции.Получить() Тогда 
		Режим = ПолучитьРежимТрансляции(Источник.Организация, Источник.дата);
		
		Если Режим = Перечисления.А_РежимыТрансляции.OnLine Тогда 
			
			ТипИсточника = ТипЗнч(Источник);
			МетаданныеИсточника = Источник.Метаданные();
			Если Источник.ОтражатьВБухгалтерскомУчете Тогда 
				СформироватьДокументУУ(Источник, МетаданныеИсточника, ТипИсточника, Отказ, РежимПроведения);
				МенеджерЗаписи = РегистрыСведений.А_ОчередьТрансляции.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Активность = Истина;
				МенеджерЗаписи.Объект = Источник.Ссылка;
				МенеджерЗаписи.Организация = Источник.Организация;
				МенеджерЗаписи.ПоставленоВОчередь = ТекущаяДата();
				МенеджерЗаписи.Записать(Истина);
			КонецЕсли;
		ИначеЕсли Режим = Перечисления.А_РежимыТрансляции.Отложенный Тогда 
			
					
			
		КонецЕсли;
		
		Если ТипЗнч(Источник) = тип("ДокументОбъект.УпрРасходныйКассовыйОрдер") 
			или ТипЗнч(Источник) = тип("ДокументОбъект.УпрПриходныйКассовыйОрдер") Тогда 
			
			МенеджерЗаписи = РегистрыСведений.А_ОчередьТрансляции.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Активность = Истина;
			МенеджерЗаписи.Объект = Источник.Ссылка;
			МенеджерЗаписи.Организация = Источник.Организация;
			МенеджерЗаписи.ПоставленоВОчередь = ТекущаяДата();
			МенеджерЗаписи.Записать(Истина);
			
		КонецЕсли;
		
	КонецЕсли;
Исключение
	КонецПопытки;
КонецПроцедуры

Процедура ОбработкаПроведенияПоступлениеТоваровУслуг(Источник, МетаданныеИсточника)
	
	ЗаполнитьСубконтоПартия(Источник, МетаданныеИсточника, Источник.Ссылка);
	
	// А_Вячеслав(18.01.2019 перепроведем корректировки документа
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	А_КорректировкаСтоимости.Ссылка
		|ИЗ
		|	Документ.А_КорректировкаСтоимости КАК А_КорректировкаСтоимости
		|ГДЕ
		|	А_КорректировкаСтоимости.ДокументОснование = &ТекДокумент
		|	И А_КорректировкаСтоимости.Проведен";
	
	Запрос.УстановитьПараметр("ТекДокумент",Источник.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		оОбъект = Выборка.Ссылка.ПолучитьОбъект();
		оОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла; 
	// А_Вячеслав)
	
КонецПроцедуры

Процедура ОбработкаПроведенияРегистрацияВходящегоНалоговогоДокумента(Источник, МетаданныеИсточника)
	
	ЗаполнитьСубконтоПартия(Источник, МетаданныеИсточника,  Источник.ДокументОснование);
	
КонецПроцедуры


Процедура ОбработкаПроведенияНалоговаяНакладная(Источник, МетаданныеИсточника)
	
	ЗаполнитьСубконтоПартия(Источник, МетаданныеИсточника,  Источник.ДокументОснование);
	
КонецПроцедуры

Процедура ОбработкаПроведенияПриложение2КНалоговойНакладной(Источник, МетаданныеИсточника)
	
	ЗаполнитьСубконтоПартия(Источник, МетаданныеИсточника,  Источник.НалоговаяНакладная.ДокументОснование);
	
КонецПроцедуры

Процедура ОбработкаПроведенияАктОбОказанииПроизводственныхУслуг(Источник, МетаданныеИсточника)
	
	ЗаполнитьСубконтоПартия(Источник, МетаданныеИсточника,  Источник.Ссылка);
	
КонецПроцедуры



/////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ПОДПИСКИ НА СОБЫТИЕ ПЕРЕД ЗАПИСЬЮ ДОКУМЕНТОВ ////

Процедура ПередЗаписьюДокументов(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	//+004217 ВБалако 20210215
	//Если Отказ Тогда 
	Если Отказ или РольДоступна("ФайловаяРоль") или Источник.ОбменДанными.Загрузка Тогда
	//-004217 ВБалако 20210215
	
		Возврат
	КонецЕсли;
	
	ТипИсточника = ТипЗнч(Источник);
	МетаданныеИсточника = Источник.Метаданные();

	// +++ А_ИТ4Б Ересько 2016-09-23 {Перенес с обработки проведения в событие перез записью. Теперь не задаем вопрос, а молча изменяем время на две секунды назад} (Начало
	//  А_Клещев
	Если  Источник.Дата = КонецМесяца(Источник.Дата) тогда
		Если ТипИсточника <> Тип("ДокументОбъект.ЗакрытиеМесяца") 
		   И ТипИсточника <> Тип("ДокументОбъект.ОпределениеФинансовыхРезультатов") Тогда
			//Источник.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			//Отказ= Истина;
			//Сообщить("Документ не может быть проведен концом месяца...Измените время документа",СтатусСообщения.ОченьВажное);
			Источник.Дата = Источник.Дата - 2
		КонецЕсли;
	КонецЕсли;	
	//  А_Клещев
	// +++ А_ИТ4Б Ересько 2016-09-23 Конец)
	
	А_ОбщегоНазначения.УстановитьВремяДокументов(МетаданныеИсточника, Источник, РежимЗаписи, РежимПроведения);
	
	//Если ТипИсточника = Тип("ДокументОбъект.ПоступлениеДопРасходов") Тогда
	//	ПередЗаписьюПоступлениеДопРасходов(Источник, МетаданныеИсточника, Отказ)
	//ИначеЕсли ТипИсточника = Тип("ДокументОбъект.СчетНаОплатуПокупателю") Тогда
	//	ПередЗаписьюСчетНаОплатуПокупателю(Источник, МетаданныеИсточника, Отказ)
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписьюПоступлениеДопРасходов(Источник, МетаданныеИсточника, Отказ)
	
	А_ОбщегоНазначения.ЗаполнитьПоступлениеДопРасходовПоПеремещению(Источник, Источник.А_ДокументОснование, Источник.Товары, Истина);
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ПОДПИСКИ НА СОБЫТИЕ ПРИ КОПИРОВАНИИ ДОКУМЕНТОВ ////

Процедура ПриКопированииДокументов(Источник, ОбъектКопирования) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);
	МетаданныеИсточника = Источник.Метаданные();
	
	Если ТипИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		ПриКопированииРеализацияТоваровУслуг(Источник, МетаданныеИсточника, ОбъектКопирования)
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопированииРеализацияТоваровУслуг(Источник, МетаданныеИсточника, ОбъектКопирования)
	
	//Для Каждого СтрокаТовары Из Источник.Товары Цикл
	//	
	//КонецЦикла; 
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////////////
////// ПРОЦЕДУРЫ И ФУНКЦИИ УДАЛЕНИЧ ПРОВЕДЕНИЯ ДОКУМЕНТОВ/////

Процедура А_ОбработкаУдаленияПроведенияДокументовОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	Если Отказ Тогда
		Возврат
	КонецЕсли;
	
	ТипИсточника = ТипЗнч(Источник);
	МетаданныеИсточника = Источник.Метаданные();
	
	ДанныеУУ = А_ОбщегоНазначения.ПолучитьСвязанныйДокументУУ(Источник.ссылка);
	Если Не ДанныеУУ.Заблокирован Тогда	
		Если ДанныеУУ.ДокументУУ <> Неопределено Тогда 
			Об = ДанныеУУ.ДокументУУ.ПолучитьОбъект();
			Об.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура А_ПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	ДанныеУУ = А_ОбщегоНазначения.ПолучитьСвязанныйДокументУУ(Источник.ссылка);
	
	Если Не ДанныеУУ.Заблокирован Тогда	
		Если ДанныеУУ.ДокументУУ <> Неопределено и ДанныеУУ.ДокументУУ.ПометкаУдаления<>Источник.ПометкаУдаления Тогда 
			Об = ДанныеУУ.ДокументУУ.ПолучитьОбъект();
			Об.ПометкаУдаления = Источник.ПометкаУдаления; 
			Об.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////
////////////////////////// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ////////////////////////

Процедура СформироватьДокументУУ(Источник, МетаданныеИсточника, ТипИсточника, Отказ, РежимПроведения) Экспорт 
	
	// А_Вячеслав(20.11.2018 не создаем УУ документ для зеркального ПТУ , созданного из РТУ
	Если МетаданныеИсточника.Имя = "ПоступлениеТоваровУслуг" Тогда
		Если Источник.ДополнительныеСвойства.Свойство("А_ЭтоЗеркальныйРТУДокумент") Тогда
			Возврат;
		КонецЕсли;
		Если ЗначениеЗаполнено(А_ОбщегоНазначенияСервер.ПолучитьИзначальныйДокументИзСвязанного(Источник.Ссылка)) Тогда
			Возврат;
		КонецЕсли; 
	ИначеЕсли МетаданныеИсточника.Имя = "РеализацияТоваровУслуг"  Тогда 
		
		Если Найти(Источник.Комментарий,"#Создано автоматический по документу в Ренг учете")<>0 Тогда 
			Возврат;	
		КонецЕсли;
		
		////Дандали В. 14.05.2025 +
		//Если Найти(Источник.Комментарий, "#Создано автоматический при проведении чека") <> 0 
		//	И ЗначениеЗаполнено(Источник.сделка) 
		//	И Источник.сделка.Организация = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("e818acc3-d3f3-11e5-84b2-005056875f16")) //ФОП ШЕВЧУК Оксана
		//	Тогда
		//	Возврат;
		//КонецЕсли;
		////Дандали В. 14.05.2025 -
		
		
	КонецЕсли;
	// А_Вячеслав) 
	ОбъектМетаданныхХозрасчетный = Метаданные.РегистрыБухгалтерии.Хозрасчетный;
	
	ЕстьПризнакОтражатьВУправленческомУчете = МетаданныеИсточника.Реквизиты.Найти("ОтражатьВУправленческомУчете") <> Неопределено;
	ЕстьПризнакОтражатьВУпрУчете = МетаданныеИсточника.Реквизиты.Найти("ОтражатьВУпрУчете") <> Неопределено;
	
	МассивДругихДокументов = Новый Массив;
	МассивДругихДокументов.Добавить(Метаданные.Документы.ПриемНаРаботуВОрганизацию);
	МассивДругихДокументов.Добавить(Метаданные.Документы.КадровоеПеремещениеОрганизаций);
	МассивДругихДокументов.Добавить(Метаданные.Документы.УвольнениеИзОрганизаций);
	МассивДругихДокументов.Добавить(Метаданные.Документы.ОперацияБух);
	МассивДругихДокументов.Добавить(Метаданные.Документы.КорректировкаЗаписейРегистров);
	МассивДругихДокументов.Добавить(Метаданные.Документы.РегистрацияВходящегоНалоговогоДокумента);
	МассивДругихДокументов.Добавить(Метаданные.Документы.НалоговаяНакладная);

	
	ЭтоДругойДокумент = МассивДругихДокументов.Найти(МетаданныеИсточника) <> Неопределено;	
	
	Если ((МетаданныеИсточника.Движения.Содержит(ОбъектМетаданныхХозрасчетный)	 
		//И ((ЕстьПризнакОтражатьВУправленческомУчете И Источник.ОтражатьВУправленческомУчете) Или (ЕстьПризнакОтражатьВУпрУчете И Источник.ОтражатьВУпрУчете)) 
		Или ЭтоДругойДокумент)
		И ?(ТипЗнч(Источник) = тип("ДокументОбъект.КорректировкаЗаписейРегистров"),Истина,Источник.Организация.А_БухгалтерскийУчет)) Тогда
		
		
		Если ТипЗнч(Источник) = тип("ДокументОбъект.КорректировкаЗаписейРегистров") Тогда 
			НаборЗаписей = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.регистратор.установить(Источник.ссылка);
			НаборЗаписей.Прочитать();
			ОрганизацияБУ = НаборЗаписей[0].Организация;
		Иначе
			ОрганизацияБУ = Источник.Организация;
		КонецЕсли;

		
		ДокументБУ = Источник.Ссылка;
		
		//Ищем соответствие УУ организацию
		ОрганизацияУУ = А_ОбщегоНазначения.ПолучитьОрганизациюУУ(ОрганизацияБУ);
		
		Если Не ЗначениеЗаполнено(ОрганизацияУУ) Тогда
			Сообщить("Не найдено соответствие организация УУ"); 
			Возврат
		КонецЕсли;
		
		
		Набор = РегистрыСведений.ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();
        Набор.Отбор.Организация.Установить(ОрганизацияУУ);
		Набор.Прочитать();
		
		Если Не Набор.Количество() = 0 Тогда 
			Для Каждого Строка из Набор Цикл 
				//Если ЗначениеЗаполнено(Строка.ГраницаЗапретаИзменений) И Строка.ГраницаЗапретаИзменений > Источник.Дата Тогда 
				//	Сообщить("Для организации УУ редактирование данных этого периода запрещено. Изменения не могут быть записаны...");
				//	Возврат;
				//КонецЕсли;
			КонецЦикла;
		КонецЕсли;
				
		
		//Ищем существующий документ
		ДанныеУУ = А_ОбщегоНазначения.ПолучитьСвязанныйДокументУУ(ДокументБУ);
		
		Если ЭтоДругойДокумент Тогда
			
			//Если ДанныеУУ.ДокументУУ = Неопределено Тогда 
			//
			//	#Если Клиент Тогда
			//		Если Вопрос("Продублировать данный документ по упр. учету?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да  Тогда 
			//			Возврат
			//		КонецЕсли;			
			//	#Иначе
			//		Возврат
			//	#КонецЕсли
			//	
			//КонецЕсли; 
			
		КонецЕсли;
		
		Если ДанныеУУ.ДокументУУ = Неопределено 
			или не ЗначениеЗаполнено(ДанныеУУ.ДокументУУ) Тогда 
			
			ДокументОбъектУУ             = Источник.Скопировать();
			Если не ТипЗнч(Источник) = тип("ДокументОбъект.КорректировкаЗаписейРегистров") Тогда 
				ДокументОбъектУУ.Организация = ОрганизацияУУ;
			КонецЕсли;
			ДокументОбъектУУ.Дата        = Источник.Дата;
			
			Если  МетаданныеИсточника.Имя = "АктОбОказанииПроизводственныхУслуг"
				Или МетаданныеИсточника.Имя = "ВозвратТоваровПоставщикуИзНТТ"
				Или МетаданныеИсточника.Имя = "КомплектацияНоменклатуры"
				Или МетаданныеИсточника.Имя = "КорректировкаДолгаПоВозвратнойТаре"
				Или МетаданныеИсточника.Имя = "КорректировкаКачестваТоваров"
				Или МетаданныеИсточника.Имя = "КорректировкаСерийИХарактеристикТоваров"
				Или МетаданныеИсточника.Имя = "ОтчетКомитентуОПродажах"
				Или МетаданныеИсточника.Имя = "ПереоценкаТоваровВРознице"
				Или МетаданныеИсточника.Имя = "ПоступлениеДопРасходов"
				Или МетаданныеИсточника.Имя = "ПоступлениеТоваровУслугВНТТ" Тогда
				
				ДокументОбъектУУ.мУчетнаяПолитикаБУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(ДокументОбъектУУ.Дата, Ложь, ДокументОбъектУУ.Организация, "Бух", Ложь);
				ДокументОбъектУУ.мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(ДокументОбъектУУ.Дата, Ложь, ДокументОбъектУУ.Организация, "Нал", Ложь)
				
			КонецЕсли;
			
		Иначе 
			
			//Проверка на блокировку документа. Если не заблокирован - перезаполянем
			Если Не ДанныеУУ.Заблокирован Тогда 
				
				ДокументОбъектУУ = ДанныеУУ.ДокументУУ.ПолучитьОбъект();
				
				Попытка
					ЗаполнитьЗначенияСвойств(ДокументОбъектУУ, Источник,, "Номер,Организация,Проведен");
				Исключение
					ЗаполнитьЗначенияСвойств(ДокументОбъектУУ, Источник,, "Номер,Проведен");
				КонецПопытки;
				
				Для Каждого ТабЧасть Из Источник.Метаданные().ТабличныеЧасти Цикл
					ДокументОбъектУУ[ТабЧасть.Имя].Загрузить(Источник[ТабЧасть.Имя].Выгрузить());
				КонецЦикла;
				
			Иначе
				
				Возврат
				
			КонецЕсли;
			
		КонецЕсли;
		МетаданныеДокумента          = ДокументОбъектУУ.Метаданные();

		Если ЭтоДругойДокумент Тогда 
						Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОтражатьВУпрУчете",МетаданныеДокумента) Тогда 
				ДокументОбъектУУ.ОтражатьВУпрУчете	= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), ОрганизацияУУ, "ОтражатьВУпрУчете");
			КонецЕсли;
			
			Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОтражатьВРеглУчете",МетаданныеДокумента) Тогда 
				ДокументОбъектУУ.ОтражатьВРеглУчете	= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), ОрганизацияУУ, "ОтражатьВРеглУчете");
			КонецЕсли;
			
			Если МетаданныеИсточника = Метаданные.Документы.УвольнениеИзОрганизаций Тогда 
				
				Для Каждого СтрокаТЧ Из ДокументОбъектУУ.РаботникиОрганизации Цикл
					СтрокаТЧ.УвольнятьВУпрУчете = Истина
				КонецЦикла; 
				
			КонецЕсли;
				
		КонецЕсли;
		
		//Заполнение счетов учета
		А_ОбщегоНазначения.ЗаполнитьСчетаУчета(ДокументОбъектУУ, Источник, МетаданныеИсточника);
		
		//Заполнение связанные реквизиты
		А_ОбщегоНазначения.ЗаполнитьСвязанныеРеквизиты(ДокументОбъектУУ, Источник, МетаданныеИсточника);
		
		//Выполнение трансляции документов
		А_ОбщегоНазначения.ВыполнитьТрансляциюДокументов(ДокументОбъектУУ, Источник, МетаданныеИсточника);
		
		//Для механизма учета НДС перезаполним счета с РС "Счета учена расчета с контрагентами"
		А_ОбщегоНазначения.ПерезаполнитьСчетаУчетаНДСПоРегиструУчета(МетаданныеИсточника, ДокументОбъектУУ);		
		
		Попытка
			Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОтражатьВУправленческомУчете",МетаданныеДокумента) Тогда
				ДокументОбъектУУ.ОтражатьВУправленческомУчете = Ложь;
			КонецЕсли;
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;

		Если ТипЗнч(ДокументОбъектУУ) = тип("ДокументОбъект.ОперацияБух")
			или ТипЗнч(ДокументОбъектУУ) = тип("ДокументОбъект.КорректировкаЗаписейРегистров") Тогда 
			
			Для Каждого ЗаписьОперации из ДокументОбъектУУ.Движения.Хозрасчетный цикл
				ЗаписьОперации.Период = ДокументОбъектУУ.Дата;
			КонецЦикла;
			
		КонецЕсли;
		
		
		Если ТипЗнч(Источник) = тип("ДокументОбъект.ПриходныйКассовыйОрдер") или   
			ТипЗнч(Источник)  = тип("ДокументСсылка.ПриходныйКассовыйОрдер") или
			ТипЗнч(Источник)  = тип("ДокументОбъект.РасходныйКассовыйОрдер") или
			ТипЗнч(Источник)  = тип("ДокументСсылка.РасходныйКассовыйОрдер")  Тогда 
			
			Если ЗначениеЗаполнено(Источник.КассаУпр) Тогда 
				ДокументОбъектУУ.Касса = Источник.КассаУпр;
				ДокументОбъектУУ.ОтражатьВУправленческомУчете = Истина
			КонецЕсли;
			
		КонецЕсли;
			
			
		
		
		Попытка
			ДокументОбъектУУ.Записать(РежимЗаписиДокумента.Запись) ;
			Если не ТипЗнч(ДокументОбъектУУ) = тип("ДокументОбъект.ОперацияБух")
				и не ТипЗнч(ДокументОбъектУУ) = тип("ДокументОбъект.КорректировкаЗаписейРегистров") Тогда 
				ДокументОбъектУУ.обменДанными.Загрузка = истина;
				ДокументОбъектУУ.Проведен = истина;
				ДокументОбъектУУ.Записать() ;
			КонецЕсли;
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
		Попытка
			Если ТипЗнч(Источник) = тип("ДокументОбъект.ПриходныйКассовыйОрдер") или   
				ТипЗнч(Источник)  = тип("ДокументСсылка.ПриходныйКассовыйОрдер") или
				ТипЗнч(Источник)  = тип("ДокументОбъект.РасходныйКассовыйОрдер") или
				ТипЗнч(Источник)  = тип("ДокументСсылка.РасходныйКассовыйОрдер")  Тогда 
				Если Источник.ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыПоВедомостям Тогда
					ДокументОбъектУУ.обменДанными.Загрузка = Истина;
				ДокументОбъектУУ.Проведен = истина;
				ДокументОбъектУУ.Записать() ;
					Иначе
				ДокументОбъектУУ.обменДанными.Загрузка = Ложь;
				ДокументОбъектУУ.Проведен = истина;
				ДокументОбъектУУ.Записать(РежимЗаписиДокумента.Проведение) ;
				КонецЕсли;
			КонецЕсли;
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;

		
		
		// Копируем проводки 1 в 1
		
		
		НаборЗаписей = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.регистратор.установить(Источник.Ссылка);
		НаборЗаписей.Прочитать();
		
		
		Если НаборЗаписей.Количество() Тогда 
			НаборЗаписейПриемник = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
			НаборЗаписейПриемник.Отбор.регистратор.установить(ДокументОбъектУУ.ссылка);
			НаборЗаписейПриемник.Прочитать();
			НаборЗаписейПриемник.Очистить();
			
			НаборЗаписейПриемник.Загрузить(НаборЗаписей.Выгрузить());
			НаборЗаписейПриемник.Отбор.регистратор.установить(ДокументОбъектУУ.ссылка);
			Для Каждого Запись из НаборЗаписейПриемник цикл
				Запись.Период      = Источник.дата; 
				Запись.Регистратор = ДокументОбъектУУ.ссылка; 
				Запись.Организация = ОрганизацияУУ;	
				
				
				Если ТипЗнч(Источник) = тип("ДокументОбъект.ПриходныйКассовыйОрдер") или   
					ТипЗнч(Источник)  = тип("ДокументСсылка.ПриходныйКассовыйОрдер") или
					ТипЗнч(Источник)  = тип("ДокументОбъект.РасходныйКассовыйОрдер") или
					ТипЗнч(Источник)  = тип("ДокументСсылка.РасходныйКассовыйОрдер")  Тогда 
					
					Если ЗначениеЗаполнено(Источник.КассаУпр) Тогда 
						
						Если Запись.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("301") Тогда 
							
							ОбщегоНазначения.УстановитьСубконто(Запись.СчетДт, Запись.СубконтоДт, "ОбособленныеПодразделенияБезОбразованияЮрЛица", Источник.КассаУпр.ОбособленноеПодразделение);	
							
						КонецЕсли;
						
						Если Запись.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("301") Тогда 
							
							ОбщегоНазначения.УстановитьСубконто(Запись.СчетКт, Запись.СубконтоКт, "ОбособленныеПодразделенияБезОбразованияЮрЛица", Источник.КассаУпр.ОбособленноеПодразделение);
							
						КонецЕсли;
						
					КонецЕсли;
				КонецЕсли;
				
				
				Если ТипЗнч(Источник) = тип("ДокументОбъект.НачислениеЗарплатыРаботникамОрганизаций") или   
					ТипЗнч(Источник)  = тип("ДокументСсылка.НачислениеЗарплатыРаботникамОрганизаций")   Тогда 
					
				 
						
					Если Запись.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("661") 
						или Запись.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("663") 
						или Запись.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("903") Тогда 
							
							ПрдразделениеСотрудника = ПолучитьПодразделениеСотрудника(Запись.СубконтоДт.РаботникиОрганизаций);

							
							ОбщегоНазначения.УстановитьСубконто(Запись.СчетДт, Запись.СубконтоДт, "вчПодразделения", ПрдразделениеСотрудника);	
							ОбщегоНазначения.УстановитьСубконто(Запись.СчетДт, Запись.СубконтоДт, "Проекты", ?(ЗначениеЗаполнено(ПрдразделениеСотрудника),ПрдразделениеСотрудника.Проект,Справочники.Проекты.ПустаяСсылка()));	
						
						КонецЕсли;
						
						Если Запись.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("661")
							или Запись.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("663")
							или Запись.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("903") Тогда 
							
							
							ПрдразделениеСотрудника = ПолучитьПодразделениеСотрудника(Запись.СубконтоКт.РаботникиОрганизаций);

							
							ОбщегоНазначения.УстановитьСубконто(Запись.СчетКт, Запись.СубконтоКт, "вчПодразделения", ПрдразделениеСотрудника);
							ОбщегоНазначения.УстановитьСубконто(Запись.СчетКт, Запись.СубконтоКт, "Проекты", ?(ЗначениеЗаполнено(ПрдразделениеСотрудника),ПрдразделениеСотрудника.Проект,Справочники.Проекты.ПустаяСсылка()));
							
						КонецЕсли;
						
					
				КонецЕсли;

				
			КонецЦикла;
			
			
			
			
			
			НаборЗаписейПриемник.Записать();
		КонецЕсли;
		
		
		Если ДанныеУУ.ДокументУУ = Неопределено
			или не ЗначениеЗаполнено(ДанныеУУ.ДокументУУ) Тогда
			
			ДокументУУ = ДокументОбъектУУ.Ссылка;
			
			//Добавляем документы в соответсвие
			А_ОбщегоНазначения.ЗаписатьСоответствиеДокументов_БУ_УУ(ДокументБУ, ДокументУУ, Ложь)
			
		КонецЕсли;
		
		Если ТипЗнч(Источник) = тип("ДокументОбъект.ПриходныйКассовыйОрдер") или   
					ТипЗнч(Источник)  = тип("ДокументСсылка.ПриходныйКассовыйОрдер") или
					ТипЗнч(Источник)  = тип("ДокументОбъект.РасходныйКассовыйОрдер") или
					ТипЗнч(Источник)  = тип("ДокументСсылка.РасходныйКассовыйОрдер") или  
					
					ТипЗнч(Источник)  = тип("ДокументОбъект.ПлатежноеПоручениеВходящее") или   
					ТипЗнч(Источник)  = тип("ДокументСсылка.ПлатежноеПоручениеВходящее") или
					ТипЗнч(Источник)  = тип("ДокументОбъект.ПлатежноеПоручениеИсходящее") или
					ТипЗнч(Источник)  = тип("ДокументСсылка.ПлатежноеПоручениеИсходящее")   Тогда
					ЗаполнитьАналитику(Источник);			
		КонецЕсли;
	ИначеЕсли ТипЗнч(Источник) = тип("ДокументОбъект.УпрРасходныйКассовыйОрдер")
		или ТипЗнч(Источник) = тип("ДокументОбъект.УпрПриходныйКассовыйОрдер") Тогда 
		ЗаполнитьАналитику(Источник);
	КонецЕсли;
	
КонецПроцедуры


Процедура ЗаполнитьСубконтоПартия(Источник, МетаданныеИсточника, Партия)
	
	Если Не Источник.Организация.А_УправленческийУчет Тогда
		Возврат
	КонецЕсли;
	
	МассивНужныхСчетов = Новый Массив;
	МассивНужныхСчетов.Добавить(ПланыСчетов.Хозрасчетный.НалоговыеОбязательства);
	МассивНужныхСчетов.Добавить(ПланыСчетов.Хозрасчетный.НалоговыеОбязательстваНеподтвержденные);
	МассивНужныхСчетов.Добавить(ПланыСчетов.Хозрасчетный.НалоговыйКредит);
	МассивНужныхСчетов.Добавить(ПланыСчетов.Хозрасчетный.НалоговыйКредитНеподтвержденный);
	
	Для Каждого СтрокаХозрасчетный Из Источник.Движения.Хозрасчетный Цикл
			
		Если МассивНужныхСчетов.Найти(СтрокаХозрасчетный.СчетДт) <> Неопределено Тогда
			ОбщегоНазначения.УстановитьСубконто(СтрокаХозрасчетный.СчетДт, СтрокаХозрасчетный.СубконтоДт, "Партии", Партия);
		КонецЕсли;
		
		Если МассивНужныхСчетов.Найти(СтрокаХозрасчетный.СчетКт) <> Неопределено Тогда
			ОбщегоНазначения.УстановитьСубконто(СтрокаХозрасчетный.СчетКт, СтрокаХозрасчетный.СубконтоКт, "Партии", Партия);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьРежимТрансляции(Организация, дата)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	А_НастройкиРежимовТрансляцииСрезПоследних.Режим
	               |ИЗ
	               |	РегистрСведений.А_НастройкиРежимовТрансляции.СрезПоследних(&Период, Организация = &Организация) КАК А_НастройкиРежимовТрансляцииСрезПоследних";
	Запрос.УстановитьПараметр("Период",Дата);
	Запрос.УстановитьПараметр("Организация",Организация);
	
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() Тогда 
		Возврат РезультатЗапроса[0].Режим;
	КонецЕсли;
	
	Возврат Перечисления.А_РежимыТрансляции.Отложенный;
КонецФункции


Процедура ЗаполнитьАналитику(ДокВходящий)
	Попытка
	ДокументВходящий = ДокВходящий.ссылка;
	Если ЗначениеЗаполнено(А_ОбщегоНазначения.ПолучитьСвязанныйДокументУУ(ДокументВходящий).ДокументУУ) Тогда 
				Документ = А_ОбщегоНазначения.ПолучитьСвязанныйДокументУУ(ДокументВходящий).ДокументУУ;
			Иначе
				Документ = ДокументВходящий;
			КонецЕсли;
			
			//Источник = Строка.Документ.ПолучитьОбъект();
			
			НаборЗаписей = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.регистратор.Установить(Документ);			
			НаборЗаписей.Прочитать();
			Индекс = 0;
			Для Каждого Запись из НаборЗаписей Цикл
				
				
				Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("Подразделение",Документ.Метаданные(),"РасшифровкаПлатежа") Тогда 
					Попытка
						Если ЗначениеЗаполнено(Документ.РасшифровкаПлатежа[Индекс].Подразделение) Тогда 
							Запись.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.вчПодразделения]  = Документ.РасшифровкаПлатежа[Индекс].Подразделение;	
							Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.вчПодразделения]  = Документ.РасшифровкаПлатежа[Индекс].Подразделение;
						Иначе
							Если ОбщегоНазначения.ЕстьРеквизитДокумента("Подразделение",Документ.Метаданные()) Тогда
								Если ЗначениеЗаполнено(Документ.Подразделение) Тогда
									
									Запись.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.вчПодразделения]  = Документ.Подразделение;	
									Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.вчПодразделения]  = Документ.Подразделение;
								КонецЕсли;
							КонецЕсли;
							
						КонецЕсли;
					Исключение
						Если ОбщегоНазначения.ЕстьРеквизитДокумента("Подразделение",Документ.Метаданные()) Тогда
							Если ЗначениеЗаполнено(Документ.Подразделение) Тогда
								
								Запись.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.вчПодразделения]  = Документ.Подразделение;	
								Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.вчПодразделения]  = Документ.Подразделение;
							КонецЕсли;
						КонецЕсли;
						
					КонецПопытки;
				ИначеЕсли ОбщегоНазначения.ЕстьРеквизитДокумента("Подразделение",Документ.Метаданные()) Тогда
					Если ЗначениеЗаполнено(Документ.Подразделение) Тогда
						
						Запись.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.вчПодразделения]  = Документ.Подразделение;	
						Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.вчПодразделения]  = Документ.Подразделение;
					КонецЕсли;
				КонецЕсли;
				
				
				
				Если ОбщегоНазначения.ЕстьРеквизитДокумента("Проект",Документ.Метаданные()) Тогда 
					Если ЗначениеЗаполнено(Документ.Проект) Тогда 
						
						если ЗначениеЗаполнено(Запись.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты)) Тогда 
							Запись.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты]  = Документ.Проект;	
						КонецЕсли;
						
						если ЗначениеЗаполнено(Запись.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты)) Тогда 					
							Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты]  = Документ.Проект;
						КонецЕсли;
						
					ИначеЕсли ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("Проект",Документ.Метаданные(),"РасшифровкаПлатежа") Тогда   
						Попытка
							если ЗначениеЗаполнено(Запись.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты)) Тогда 
								Запись.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты]  = Документ.РасшифровкаПлатежа[Индекс].Проект;	
							КонецЕсли;
							
							
							Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты]  = Документ.РасшифровкаПлатежа[Индекс].Проект;
						Исключение
							Если ОбщегоНазначения.ЕстьРеквизитДокумента("Проект",Документ.Метаданные()) Тогда 
								
								Если ЗначениеЗаполнено(Документ.Проект) Тогда 
									если ЗначениеЗаполнено(Запись.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты)) Тогда 
										
										Запись.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты]  = Документ.Проект;
									КонецЕсли;
									если ЗначениеЗаполнено(Запись.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты)) Тогда 					
										
										Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты]  = Документ.Проект;
									КонецЕсли;
								Иначе
									если ЗначениеЗаполнено(Запись.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты)) Тогда 
										
										Запись.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты]  = Документ.РасшифровкаПлатежа[0].Проект;
									КонецЕсли;
									если ЗначениеЗаполнено(Запись.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты)) Тогда 					
										
										Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты]  = Документ.РасшифровкаПлатежа[0].Проект;
									КонецЕсли;
									
								КонецЕсли;
							Иначе
								если ЗначениеЗаполнено(Запись.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты)) Тогда 
									
									Запись.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты]  = Документ.РасшифровкаПлатежа[0].Проект;
								КонецЕсли;
								если ЗначениеЗаполнено(Запись.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты)) Тогда 					
									
									Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты]  = Документ.РасшифровкаПлатежа[0].Проект;
								КонецЕсли;
								
							КонецЕсли;
						КонецПопытки;
					КонецЕсли;
				Иначе
					
					Попытка
						если ЗначениеЗаполнено(Запись.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты)) Тогда 
							
							Запись.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты]  = Документ.РасшифровкаПлатежа[Индекс].Проект;	
						КонецЕсли;
						если ЗначениеЗаполнено(Запись.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты)) Тогда 					
							
							Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты]  = Документ.РасшифровкаПлатежа[Индекс].Проект;
						КонецЕсли;
					Исключение
						Если ОбщегоНазначения.ЕстьРеквизитДокумента("Проект",Документ.Метаданные()) Тогда 
							
							
							Если ЗначениеЗаполнено(Документ.Проект) Тогда 
								если ЗначениеЗаполнено(Запись.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты)) Тогда 
									
									Запись.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты]  = Документ.Проект;	
								КонецЕсли;
								если ЗначениеЗаполнено(Запись.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты)) Тогда 					
									
									Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты]  = Документ.Проект;
								КонецЕсли;	
							КонецЕсли;
						Иначе
							Попытка
								если ЗначениеЗаполнено(Запись.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты)) Тогда 
									
									Запись.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты]  = Документ.РасшифровкаПлатежа[0].Проект;;	
								КонецЕсли;
								если ЗначениеЗаполнено(Запись.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты)) Тогда 					
									
									Запись.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Проекты]  = Документ.РасшифровкаПлатежа[0].Проект;;
								КонецЕсли;	
							Исключение
							КонецПопытки;
						КонецЕсли;
					КонецПопытки;
				КонецЕсли;
				Индекс = Индекс +1;
			КонецЦикла;
			
			НаборЗаписей.Записать();
			
		Исключение
			КонецПопытки;
КонецПроцедуры
// А_Вячеслав)


Функция ПолучитьПодразделениеСотрудника(Сотрудник)
	Подразделение = Справочники.Подразделения.ПустаяСсылка();
	
	МассФизЛиц = Новый Массив;
	МассФизЛиц.Добавить(Сотрудник);
	
	СоответствиеФизЛиц = Новый Соответствие;
		СоответствиеФизЛиц.Вставить(Сотрудник);
		Справочники.ФизическиеЛица.ЗаполнитьДанныеПоФизЛицу(МассФизЛиц, СоответствиеФизЛиц);
		Если ЗначениеЗаполнено(СоответствиеФизЛиц[Сотрудник]) Тогда
			Организация 	= СоответствиеФизЛиц[Сотрудник].Организация;
			Подразделение 	= СоответствиеФизЛиц[Сотрудник].Подразделение;
		КонецЕсли;

	Возврат Подразделение;
КонецФункции
